{"podcast_details": {"podcast_title": "Basketball Coach Unplugged (A Basketball Coaching Podcast)", "episode_title": "Ep 1830 Coach Randall Interview and Read and React Discussion (Part 2)", "episode_image": "https://megaphone.imgix.net/podcasts/d624ee96-f5f1-11eb-aea4-63c25e230be3/image/2019_Coach_unplugged_rough_3000x3000.png?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " NFL Sunday Ticket is now on YouTube and YouTube TV. Which means that it just got easier to be an NFL fan, even if you live far away. Like, maybe you like the Bears, but you're hibernating in Panthers territory. But with NFL Sunday Ticket, your out of market team is never more than a short distance away. Specifically the distance from you to your remote control. NFL Sunday Ticket, now on YouTube and YouTube TV. Go to youtube.com slash presale to get $50 off. Terms and embargoes apply. Offer ends 919. No refunds, subscription auto renews. From the fifth quarter studios in Madison, Wisconsin. You're listening to Coach Unplugged. And now your host, Steve Collins. Hey everybody, welcome, welcome, welcome to Coach Unplugged. I'm so happy you decided to join us. Before we get started today, I'd like to give a big shout out to our sponsors. First of all, Dr. Dish, the number one shoe machine in the market. I've said this multiple times. We own three of them. I want a fourth and a fifth. Hey, he's listening to me. But they're so great. They work so well. They're so easy to set up. I think my record is 37 seconds or 32 seconds to set it up. But mention Coach Unplugged, they'll give you $450 off. Mention Coach Collins, they'll take good care of you. And also go over and check out ttubes.com for coaches who want to get better. This is a one-stop shop for basketball coaches. Everything you need from a nationally ranked, you know, we won three state titles. I think we were just talking recently. You know, we've won over 460 games in our program and lost 130 over the last 20 years. And I think we know the secret sauce to be successful, the roadmap, what it takes on and off the court. So go over and check it out and enjoy the podcast. Bye. So I've done that in the past. Like this guy can't leave the paint, but this guy can pop and flare or pop, you know, pop and roll, whatever you want to do. So you give them some freedom of like, well, look what's happening. Are you going to come and say, maybe get a ball, maybe get a handoff. Like, so I think that's where you could give them a lot of freedom. Again, that's where the roles are going to come in because John can pop and shoot threes, but Sam can't. You know, you can't shoot outside 12 feet. Sorry, bud. Show me you can in an empty gym and I'll let you do it. And I'm going to have those candid discussions before this year, but the thing I do like about Reading React and the rule of three is the unpredictability of it from a scouting standpoint, like you alluded to, it's hard to, I don't even know what they're going to do, but I want to give them some freedom and autonomy. So my guess is, my guess is they pass and they cut a lot. In the Reading React, we pass, we don't do any back screening. We don't look for back doors very often. What do they do? They cut. They pass and cut. Yep. So don't let them do that. For the first two weeks, they don't even cut. They go behind the defender. Yep. Don't let them do that at all. That's easy. That's what my guys were doing when we were doing Reading React too. They pass, they cut. It was predictable. So you can't, so if you have, I don't know what your rules are in your state, but if you're open gyms, like I would try- You can't do rule of three with three out, two in, right? You can. You can. I mean, pass screen away and then, but then what the slip- And the slip in that's kind of a high low, they kind of work like this. But what if it's a wing? I don't, the wing. So you pass from the top to the wing. Right. Well, there's options. Then he can come up and set a screen. He can go short corner opposite. You kind of, again, I give those, I give the three guys one set of rules and the two guys another set of rules. Yeah. Cause they won't, they won't cross each other in terms of responsibilities. Like the guys who are six, three and above will never be on the wing. No. And the guys that are shorter will never be on the block. And no, in the wing. In the wing. Yeah. Yeah. As long as you got enough depth, you can do that. Yeah. Yeah. I mean, I like it. I like both of them. I like to read and react in rule three. I mean, I think they're both good. Cause they do, they give them, but the problem is they tend to do one thing. I was in our gym today when they were playing, the kids were doing the same move. Every like, whoop, whoop. It was the same move. So as soon as they do that, I'm done. You can't do that anymore. Cause they're going to do that in a game anyway. So I got to teach you a different skill. So we'll do like three on three. You can only score off a back screen. We're just going to play three on three. Have some fun. It's a song, but you can only score on a back screen or you can only score on a flare. That's it. That's the only way you can score. Can't shoot unless you do that. And cause they don't, they're thinking they're the, you don't want them to think the good ones don't like Mike. The ones I've coached are special. It's it's like, they're not thinking that, oh crap. The kid turned his head. I need to flash to the, who they just do it. Cause they, it's a reaction. So you got to drill to get the reaction. It's like two plus two is four. I don't think about that. I just do it. It's just, I know it. It's the same thing. Yeah. It's the same thing with I'm going to pass. I'm going to cut. I'm not even cut the right way, but I'm going to pass. I'm going to cut. I'm going to pass. I'm going to cut. I mean, I swear to God, I spent like a year and a half. That's all I saw was passing cuts. It's like, great. We can do that. Right. Level one. Yeah. Level one. First thing to do. Yeah. But don't let them do level one. So when we do stuff in practice, no level one can't do it. Cause what I do like about the reading rack is the, is the Laker cut. I do like that. I do too. I like that, that give and go concept, a three of the dribble at, you know, that is kind of a, and I like the, I like what Rick says about kind of drafting behind the draft drive. The hard part with the draft is if he gets stopped, it's a hard pass back. It is really hard. We've worked on that pass because behind the driver is always open. It's always open. Look at NBA, look at college. Look, when a guy drives, if you fill in behind, it's always open. The problem is it's open because it's a hard pass to make. No one ever makes the pass bad. Right. And part of our turnovers comes from penetration into a crowded lane, which gives me pause because then they'll, they go into an area where there's two of our guys, two other guys, there's four guys in the lane. They get swallowed up like a water buffalo in a watering hole by pride of lions. Do they think they're getting to the rim? Well, they think they're going to, but they don't. They don't. They're getting stripped going in and, or, you know, tied up. I know. That's gotta be a rough first couple of months, first couple of weeks of the season when you're showing films. Like you can't do this, guys. Sorry. I'll show you a thousand clips of you driving to the hoop and getting stopped. You know, what's gonna happen? You're gonna turn over. You're gonna charge. You're gonna miss a, you're gonna take a bad shot. Nothing good's going to happen. Sorry. Smoked cigarettes. The first day of practice with my incoming freshmen, I have my best defenders in the paint. I put up orange cones and give them just a little bit wider than the width of the lane. And I put three guys in the lane and I give a freshman a basketball. And I said, okay, go one on three. And if you can score, I mean, you're gonna show me something. I don't tell them that the point is they can't do it. They can't do it. After they do it two or three times and get the crap beat out of them going in there, they said, this is impossible. Well, and then you've had a young team recently too. And when you're young and not strong, you're gonna like, a senior boy and a freshman boy is like a man versus a boy. It really is. It really is. My 6'8 kid is 6'8, 235. When I was a freshman, he was 6'5 and maybe 200. Yeah. And also- They just changed him. No, I would stick with it if you think the Read and React and Rule 3 works. I would, I mean- I understand it. So for me, I get it. So I'm, it's getting them to understand it, but I look at it all year long. Yeah. And you think about it all year long. Exactly. You, yes. And they don't. I'm just trying to make myself better for the benefit of my kids because- Well, you can eliminate a lot. It doesn't sound like it's dribble drive. It doesn't sound like, there's some, it doesn't fit. I think you fit into the right thing with who you have. You could run a triangle-ish kind of offense if you wanted to, but you better have some couple really light out shooters too if you're going to do that. I do have one. He's a legit three-point shooter. Actually him and Jordan Bohannon went head to head on a three-point shooting drill that we have. But you need more than one if you're going to run triangles. I know, I got one. Yeah, that's the problem. I got one sharp shooter. Yeah. And I don't think you want a structured, I don't think the structured continuity offenses work as well anymore because people have over scouted. Huddles made it too easy 20 years ago. They know they weren't staying up all night with me, like me and doing two VHS tapes. Like, you know, people weren't doing it. I was doing it because I wanted to win. So no, I think you stick with it. I think you just, what I would do is start working on how you're going to break it down and practice. I think that's the kicker. Like how can, how can that skillset what skills do you need and how can you break that skillset down? Like, so in the, in your, in your library of, of I've done some, there's a bunch of breakdown drills in the rule of three. I know I have a bunch in there. Okay. Like two, three, three. Is that in the main part of the teachhoops.com or is that That's in the rule of three offense. Okay. Yeah. Yeah. The other one's just kind of a general overview. Okay. So I would do that. I mean, I think that's, I mean, that's what I'm doing right now. Cause we're kind of leaving some of our stuff that we're doing and we're going to run kind of, we're going to run some rule of three and then we're going to run some zoom actions. So I'm trying to work in some continuity right now with handoffs and stuff. So what I'm thinking, what I'll spend August on is, okay, how can I drill this to teach it to them? Cause I can point- Do you have anything with the zoom action yet on the website? I don't, I'll send you, I can, after we get off here, I'll send you a video of my guys running it. Okay. During one of our contact days, I wrote myself a note, sorry. Cause we, we actually tried messing with that a little bit last year later in the year. And again, disclaimer, disclaimer, disclaimer, I'll send you the PDF that the coaches, my coaches and I have been sending back and forth. It's like 16 pages. We're still, you'll see stuff that like questions or do we do option one, option two, option three? Cause we're still trying to figure, we're working some stuff out for us, but I'll send it to you. Just know that when you see option one, you can only do one of those. Cause we're, we're, we're bouncing it back between the five of us figuring out, okay, which one's going to work? Cause we know our personnel, like, where can we put our pieces? It's like a puzzle piece. And then I'll send you my, one of my coaches and one of our contact days did taped it and sent me the tape cause I was gone. So I'll send you, it's like a 10 minute, it's not great, I mean, it's fine video, but it's on the floor. So you can see the movements. But yeah, and it's kind of, there's a continuity to that too. I like different options. It's all fair. That's what I'm saying. You could have a continuity. You can put flex in, I could teach your kids flex 10 minutes if you want something different. And then maybe the ball has got to go on the post or, you know, maybe you do a dribble drive. If you've got a couple dribblers out there, I don't know. And you said a ball, I don't know something, but I think teams, high school teams get, if you can get them out of a rhythm, you know, sometimes you're just out of rhythm. You know, their girlfriends didn't talk to them at lunch. They're out of rhythm and you got to read, you got to say, putting the paddles back on them. You got to re-shock them. One thing I saw was with the reading react with the five out, I just saw something from a coach Hackenberg, I believe, that he has a five out that, it's five out, but he can get into the flex motion out of that. So you can camouflage going into flex by being in five out initially, versus, you know, lining up in a traditional flex. Right. And then, but then after that, I know what you're going to do. After a couple of rotations, man. People are not really doing it. I'm going to, and the thing is, if you've got athletes, they're going to, I mean, I'm going to steal the ball. I mean, I'm going to take away, again, the nuance is can you run, I mean, the Badgers ran swing and flex forever. You can run it, but then you got to run it. Like you got to, what happens when I reverse it? You got to have all the counters. That's the thing with, that's the thing with continuity offenses. If I take two things away, a lot of high school teams are going to crumble because they don't have enough time. Like you said, like, you know, when Bo Ryan was running the Badgers, they were running the swing and then the finals against UK is, well, they knew all the UK takes this. We do this, we do that. It's like a chess thing. Yeah. But they have more time. We don't have that time. Shoot. You have shot clock in Wisconsin? We don't. Okay. We do in Iowa. We have two, we have two 18 minute haves. Okay. Now we've got eight minute quarters, 35 seconds shot clock. And then this year, are you adopting the new NFHS rule for fouls per quarter? We're not because we're in haves. Oh, that's okay. Yeah. So we were not following the rules anyway. So they're not going to do anything. I've, I've been fighting and I was even on the, the state association board. I was fighting for an extra timeout. I go, just give me an extra timeout. You know, 18 minutes, a lot of time. Like just let me, I don't need the, I don't need the quarters anymore. It does that. It definitely affects the flow of the game. So what do you mean? I have timeouts for the game. Five timeouts. Yeah. 18 minutes. And no one can play 36 minutes. Like my stud last year played 32, 31. I got to pull them. I don't wanna. Yeah. I got to rest both of them because you can't play 36 minutes. Yeah. Ever. But I will send that to you. I will send them as soon as we get off, I'll send that zoom stuff. I'll either, yeah, probably send it as a link. That's fine. I'll do that. I'll look for it. Okay. Anything else? Not right now. I'll just take this and kind of enjoy it. And if you get some ideas, we can bounce some ideas off. Hey, what do you think of this for? Cause I'm working on that. That's what August is for me. I'm working on breakdown stuff too. So. Oh no. One more quick question, I guess. For a set. Cause the kids asked me about this last year at the end of the year deal meeting. Since I have legitimate bigs this year, you think it would be a high low. You should definitely have a high low. High. What about running out of horns? You can run out of horns. So here's the thing with quick hitters and my assistant coach is so good at me. He says, there's so many quick hitters in the world. There are like tens of thousands of them. Yes. If I'm doing a high low, my other quick hitters should not have a high low. Like, like the quick, I'm going to get good at this. Every quick hitter should give you something like a ball screen and a isolation two man game or, you know, a horn set or a high low look. So if, if, if, if they overlap, then I'm not doing this new one. I'm only doing things that are going to give me different looks, you know what I'm saying? Cause if you grab. Do you stick with the same ones throughout the entire season? I'll do first, first half, second half, but I'll have two different types of high low looks. I'll have two different types of ball screen looks and I'll change and literally I'm only worried about a couple of coaches in my league that over scout. The rest of them don't, you know, we can run the same thing. But I want to, but I want to get really good at that high low. So they get the read. It's similar to running the offense. I want them to get the reads and what happens if they deny this and what happens at that. But I'm not going to have two high low quick hitters. I'm going to have one. And if it's no good, I'll get rid of it and get another one. But I think the problem with coaches is they, oh, they see a quick hitter and they put it in. They get a quick hitter. You want everyone to do something different because, okay, crud, we're down three. We need a three pointer. There should have a quick hitter to get a three quick three pointer. Oh shoot. We need to take some time off the clock or we need to, whatever it is, it should be something different. So when you're, when you're picking them, that's hard for me cause I'll pick one. And then a month later I'll find, Ooh, this one looks really good. Let's try it. And then he'll yell at me cause he goes, Steve, that does the same thing as this one. So I don't even get rid of that one or keep, and we've worked on that one for three weeks. Let's get better at that one. I mean, he's right. It's, it's the problem with myself is, I know it's the shiny, it's a shiny object thing and you can't do it. You got to just spend hundreds of hours during the off season and it's paralysis by analysis. Yep. And here's the other issue is like, you got to be willing to let it go. Like we didn't, we didn't have co wait during the post COVID season that, um, 21, 2021 season we didn't have and we spent an entire year getting ready for the following year. And two weeks into the season, we threw it all out cause it wasn't working. Are you guys didn't have any games? We didn't have any games. 2021 season. Huh? Zero. So, um, so it was two years ago. Yeah. We didn't, we didn't play. So think about us as coaches. We had a year of that and we had all these grand plans and it didn't work. Like this didn't work. Well, we can't like, I'm not, I threw them. I mean stuff wasn't working the first half of our season this year and we threw some stuff out and we tweaked our offense. And if it's not working, you got to tweak it. Like people can't, we're not college coaches. We don't get to decide. Like I'm just going to go recruit. Right. Yeah. You got to take what you're given. It's just this particular, this particular lineup that I have is probably a once in a it is that sizes and size wins in high school. It doesn't class one a in Iowa length and size wins. Yep. It really does in high school. I'm excited about the season. Like I said, I'm just trying to make myself the best version of myself. I can be as a coach to help them plan on getting together. I can help too. I can call. And once you get film and stuff, we can definitely do that too. It's like, I love it because it helps me a lot. All right. We'll talk coach. All right. Thank you. Yep. Bye. Hey everybody. I hope you enjoyed the podcast. Make sure you subscribe, like jump up and down. Like I say, tell your friends, that would be a good thing. Yeah. So share this on social media and then also go over and check out teacheeps.com for coaches who want to get better. Have a great day."}, "podcast_summary": "In this basketball podcast episode, the host, Steve Collins, discusses various topics related to coaching basketball. He mentions NFL Sunday Ticket and its availability on YouTube and YouTube TV, which allows fans to watch out-of-market games. He then introduces the sponsors of the podcast, Dr. Dish and ttubes.com. Afterward, Collins engages in a conversation with a coach about offensive strategies, such as the Read and React and Rule of Three offenses. They discuss the pros and cons of each and how they can be implemented effectively. They also talk about the importance of giving players freedom and autonomy within a structured offense. The conversation then moves on to quick hitters and the use of high-low sets. They touch on the importance of having multiple quick hitters that provide different options to keep the defense guessing. The coach expresses his excitement for the upcoming season and his desire to continuously improve as a coach. Overall, the podcast provides valuable insights and strategies for basketball coaches.", "podcast_guest": {"guest_name": "Steve Collins", "guest_organization": "Coach Unplugged", "guest_title": null}, "podcast_highlights": "In this transcripted podcast, the coach discusses various topics related to coaching basketball. Some highlights include:\n\n- The coach's thoughts on using the NFL Sunday Ticket as a way for fans to watch out of market games.\n- The coach's thoughts on the Read and React and Rule of Three offenses.\n- The coach's emphasis on teaching players different skills to avoid predictability.\n- The coach's discussion on breaking down offensive plays and how to drill them effectively.\n- The coach's thoughts on the high-low offense and the use of horns in quick hitters.\n- The coach's advice on choosing and implementing quick hitters that offer different options and strategies.\n\nOverall, the podcast covers a variety of coaching strategies and perspectives that can be valuable for basketball coaches."}