{"podcast_details": {"podcast_title": "The 5 Minute Basketball Coaching Podcast", "episode_title": "Ep 670  Five keys to Develop a Basketball Team or Program", "episode_image": "https://megaphone.imgix.net/podcasts/fc46e896-f95b-11eb-93f9-e7b5b61552d3/image/5_Minute_Basketball_Coach_Podcast_COLLINS__1_.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " NFL Sunday Ticket is now on YouTube and YouTube TV. Which means that it just got easier to be an NFL fan, even if you live far away. Like, maybe you like the Bears, but you're hibernating in Panthers territory. But with NFL Sunday Ticket, your out-of-market team is never more than a short distance away. Specifically the distance from you to your remote control. NFL Sunday Ticket, now on YouTube and YouTube TV. Go to youtube.com slash presale to get $50 off. Terms and embargoes apply. Offer ends 919. No refund. Water renews. From the fifth quarter studio in Madison, Wisconsin. Madison, Wisconsin. You're listening to the five minute basketball coaching podcast with our host, Steve Collins. Hey everybody. Welcome to the five minute basketball coaching podcast. Before we jump into today's topic, I'd like to give a big shout out to teachhoops.com for coaches who want to get better. It is resources, handouts. It's got everything you need to become a better basketball coach. Go over and check it out and let's head off to the podcast. Hey everybody. Welcome. Today we're gonna talk about the five quick ways you can develop your basketball team or your basketball program. These are all ways or things that you can do as a coach to kind of deep dive and make your basketball program or basketball team better. So the first one is, I don't know if it's always obvious to people, but you gotta have a long-term mindset. I can tell you the story about when I took over my program, I was the only applicant. And they had had five or six winning seasons in 30 plus years and no one wanted it. And my plan was to get us on the map in seven years. I think it took us a little bit less than that, but I had to have a long-term plan. And luckily I had great assistants. I had a great administrator. I had great assistant coaches. I had a great AD. That I was able to do that long-term plan and have that long-term mindset as far as how to tackle things. And the saying is Rome was not built in a day. It's the same with a basketball team or a basketball program. So if you think it's gonna be a quick fix, then you better coach LeBron's team because otherwise there are no quick fixes in building a successful basketball team or basketball program. So that's number one. Number two, put a premium on developing yourself. Work on your craft. Like if you wanna become a better carpenter, you become an apprentice, you learn from other carpenters. If you wanna become a better teacher or a coach, find mentors, develop your network and forget that you are part of someone's network, that you have to work on that. So that's where your mindset has to be. How will I continually grow? How will I make myself a better basketball coach? How can I learn from someone that's already done this? This has been around since Plato and Socrates that you have to learn from people that have already done it. Shameless plug, teachoops.com is the answer. But not everyone wants to join it and I'm mentoring coaches all over the world, but put a premium on developing. If it's reading, if it's watching videos, if it's breaking film down, if it's talking to other people, spend the time. You're gonna maybe have to spend some of the money because I know I have. I know I've spent tens of thousands of dollars on clinics and videos and learning and talking and people forgot. Maybe people listening to this don't remember that long distance used to cost a lot. I mean, I can tell you long distance calls over hundreds and hundreds and hundreds of dollars, me just talking to coaches. And the funny part is, again, the young coaches don't remember this, but on Sunday, you had to call. Sunday night was the cheapest time to call. So I'd always, some of my mentors or people that I learned this great game from, Sunday nights would be the time I'd call them because it'd be the cheapest for long distance. But anyway, so number two is put a premium on developing yourself. Number three, seek the give more than you receive. That's why I do these podcasts. That's why I do my YouTube channel. That's why I put content out all the time. That's why I have three podcasts, yeah, three podcasts and two more in the queue ready to come out soon because I wanna give back. I wanna share this game has given me more than I can ever give it back. And I think it's the path of successful coaches. You look at the great ones, what do they do? They give back, right? All right, next one is develop your people to people mindset that not only am I going to learn from one person to another, but I have to build that network because I never know if it's gonna be a coach in Wyoming or a coach in Rhode Island that I'm gonna learn that one thing that's going to help me. So, yes, it can be mentors, it can be mentors, it can be doing an interview. Any of those kind of things will help in your coaching. So people to people mindset. That growth mindset would be a subcategory of that. Obviously you have to be willing to fail a little bit to build your program and take it to the next level. All right, and the last one is be intentional in your actions. This is probably the hardest one for me because I always am juggling about 16 different things. Yeah, we all have jam packed schedules. We all realize that, but we need to connect with our staff. We need to connect with our other coaches, with our players, but you have to be intentional in that. I use a physical planner to do that, but you have to plan out your time. You have to plan out when things are going to get done. Like I have to plan out, you know, I put out 13 podcasts a week. You don't think I'm intentional on how I get these out to all of you. I have to be. We all have the same 24 hours. We all have the same minutes in the schedule. So I think you have to be really careful and intentional on all of these. Again, go over and check out ttubes.com for coaches who want to get better. There's nothing else like it. And trust me, no place else out there. Are you going to get the resources? That I mean, I just put up all sorts of cool clinic stuff and some trapping one, two, two stuff. And I just keep putting things in there all the time. But anyway, so let's go through those five things again. Number one, have a long-term mindset. Number two, put a premium on developing yourself. Number three, seek to give more than you receive. Number four, have that growth mindset, that person-to-person mindset. And number five, be intentional in your actions. These will all make you a better basketball coach. I hope this has helped. Hey everybody, hope you enjoyed it. Make sure you subscribe, like, jump up and down, review, do whatever you got to do. Also go over and check out ttubes.com for coaches who want to get better. Have a great. Sports Social Podcast Network."}, "podcast_summary": "The podcast discusses five quick ways that a basketball coach can develop their basketball team or program. The first way is to have a long-term mindset and plan for the future success of the team. The second way is to put a focus on developing oneself as a coach by seeking out mentors and learning from others who have already achieved success. The third way is to give back to the basketball community by sharing knowledge and resources, such as through podcasts and YouTube channels. The fourth way is to develop a people-to-people mindset and build a network of coaches who can provide valuable insights and ideas. Lastly, the fifth way is to be intentional in actions by planning and prioritizing tasks to ensure efficient use of time. The podcast also includes a shout-out to teachhoops.com, a resource for coaches looking to improve their coaching skills.", "podcast_guest": {"guest_name": "Steve Collins", "guest_organization": "TeachHoops.com", "guest_title": null}, "podcast_highlights": "Highlights of the podcast:\n\n1. Develop a long-term mindset when building a basketball team or program. Rome was not built in a day, and success takes time.\n\n2. Put a premium on developing yourself as a coach. Seek mentors, learn from others who have already achieved what you want to achieve.\n\n3. Seek to give more than you receive. Give back to the basketball community through sharing knowledge and resources.\n\n4. Develop a people-to-people mindset. Build a network of coaches and mentors from all over the world to learn from and gain new perspectives.\n\n5. Be intentional in your actions. Plan and prioritize your time effectively to connect with your staff, coaches, and players.\n\nThese five practices will help you become a better basketball coach and improve your team or program."}