{"podcast_details": {"podcast_title": "Deep Game Basketball", "episode_title": "The True Cost Of Overthinking In Basketball & Life", "episode_image": "https://kajabi-storefronts-production.kajabi-cdn.com/kajabi-storefronts-production/site/93056/podcasts/049f3171-82ae-4ad1-8575-aa68bd08a101.jpg", "episode_transcript": " That brings us full circle to that final point that I want to make. And this is a higher level application of this. But most of us go through life surrounded by this haze of thought. It's like we're disconnected from reality and from the world around us by this layer, this dense fog of our thoughts about life. And you've noticed this, I'm sure, if let's say you're in a group of friends and everybody's talking and laughing with each other, and you're stuck in your mind thinking about, oh, what are they thinking of me right now? What's the right thing to say? Feeling not so comfortable in your own skin, disconnected from those around you by your thoughts. Well, a lot of us have this chronic layer of thoughts separating ourselves, or separating us from our lives. And there's a beautiful quote from one of my favorite men ever, like favorite philosophers of all time, Alan Watts, that goes, a person who thinks all the time has nothing to think about except thoughts. Beautiful. A person who thinks all the time has nothing to think about except thoughts. We're separated from our lives by this haze of thought. And when we were on the Deep Game retreat this past year, there was one of our players during on that retreat, after a particularly deep meditation session that we did just before dinner on one of the nights, the sun's going down, we're in this beautiful idyllic setting in San Diego, outside on the lawn practicing together, and the sky is like pink and purple and palm trees. It's just so, so beautiful. There's this warm breeze and there was even a waterfall beside the pool outside on the property that we were staying at. It's so, so beautiful. And this player gets up out of this meditation, super, super clear, and he told us afterwards, he was just standing at the fence, like looking out at this idyllic scenery, this like beautiful sky and hearing the waterfall. And he said it was like seeing reality directly for the first time. There was no haze of thought in between. The haze had cleared through the meditation practice. And he was just seeing the absolute stunning beauty of the world around him. And the comment that he makes is like, oh man, if I saw the world this way all the time, I wouldn't need Instagram. Yeah, exactly. You don't need anything but like the utter stunning beauty of the world around you all the time. It's like it's right there, but we're separated from it by this haze of thought. And so a person who thinks all the time has nothing to think about except thoughts. And my strong, strong encouragement to you is to begin creating separation from your thoughts. Understand that we don't have to be stuck up here in our thoughts all the time. We don't have to be wrestling with the thoughts in our mind. Just take your attention away from them. Allow them to dissipate and allow that haze of thought to clear so that you can meet your life directly. In the same way that we meet the game directly without our attention split. We put all of ourselves into the moment. That's my wish for you. Hey, it's Taylor. I hope you enjoyed this clip. And if you'd like to watch the full length talk, we'll have the title and or link for you in the description so that you can check it out there. And as always, if you'd like to go even deeper, the best place to do that is in our free masterclass over at deepgame.com, which I believe will be the most powerful hour of basketball learning of your life. I hope we see you there."}, "podcast_summary": "Summary of the Basketball Podcast:\n\nIn this podcast, the speaker discusses the idea of being disconnected from reality and the world around us due to the constant stream of thoughts in our minds. They explain how this also applies to the game of basketball, where players often find themselves mentally distracted or preoccupied with their thoughts on the court. The speaker shares an anecdote about a player who experienced a moment of clarity and connectedness during a meditation session, where they were able to see the beauty of the world around them without the interference of their thoughts. The speaker encourages listeners to create separation from their thoughts and be fully present in the moment, both in basketball and in life. They also invite listeners to learn more through a free masterclass offered on their website.", "podcast_guest": {"guest_name": "Alan Watts", "guest_organization": null, "guest_title": null}, "podcast_highlights": "Highlights from the podcast:\n\n- Many of us go through life surrounded by a haze of thought, feeling disconnected from reality and the world around us.\n- Alan Watts said, \"A person who thinks all the time has nothing to think about except thoughts.\"\n- Through meditation, we can clear the haze of thought and see the stunning beauty of the world around us.\n- Encouragement to create separation from our thoughts and meet life directly, without constantly being stuck in our thoughts.\n- The importance of putting our full attention into the moment, just as we do in a game."}